DataProcessors/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВыдачиСИЗПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыдачиСИЗПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыданныеСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыданныеСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СредстваИндивидуальнойЗащиты/Forms/РезультатыВыдачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ФизическоеЛицо", ФизическоеЛицо);
	Параметры.Свойство("РабочееМесто", РабочееМесто);
	Параметры.Свойство("Организация", Организация);
	
	СформироватьРезультатыВыдачи();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ИмяОбласти = "Документ_1";
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ФизическоеЛицо, ИмяОбласти);
	
	НомерСтрокиОкончание = ТабличныйДокументРезультатВыдачи.ВысотаТаблицы;
	ТабличныйДокументРезультатВыдачи.Область(1, , НомерСтрокиОкончание, ).Имя = ИмяОбласти;
	
	ТабличныеДокументы = Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ТабличныйДокументРезультатВыдачи);
	
	УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, ОбъектыПечати, Ложь, 1);
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьРезультатыВыдачи()
	
	ТабличныйДокументРезультатВыдачи.Очистить();
	ТабличныйДокументРезультатВыдачи.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СИЗ_РезультатыВыдачи";
	ТабличныйДокументРезультатВыдачи.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент = РезультатыВыдачи(Организация, ФизическоеЛицо, РабочееМесто);
	ТабличныйДокументРезультатВыдачи.Вывести(ТабДокумент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатыВыдачи(Организация, ФизическоеЛицо, РабочееМесто)
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = Обработки.СредстваИндивидуальнойЗащиты.ПолучитьМакет("РезультатыВыдачи");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ФизическоеЛицо = ФизическоеЛицо;
	Шапка.Параметры.Организация = Организация;
	Шапка.Параметры.РабочееМесто = РабочееМесто;
	ТабДокумент.Вывести(Шапка);
	
	НормыВыдачиСИЗФизическогоЛица = СредстваИндивидуальнойЗащиты.НормыВыдачиСИЗФизическогоЛица(ФизическоеЛицо, РабочееМесто);
	НормыВыдачиСИЗФизическогоЛица.Сортировать("Требуется Убыв, СледующаяВыдача Убыв");
	
	ТаблицаВыдачи = ТаблицаВыдачи(ФизическоеЛицо);
	
	Для Каждого СтрокаТаблицы Из НормыВыдачиСИЗФизическогоЛица Цикл
		Если СтрокаТаблицы.СледующаяВыдача <= Сегодня Тогда
			ШапкаСИЗ = Макет.ПолучитьОбласть("ШапкаСИЗПросроченная");
		Иначе
			ШапкаСИЗ = Макет.ПолучитьОбласть("ШапкаСИЗ");
		КонецЕсли;
		ШапкаСИЗ.Параметры.Заполнить(СтрокаТаблицы);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СледующаяВыдача) Тогда
			ШапкаСИЗ.Параметры.СледующаяВыдача = НСтр("ru = 'Немедленно'");
		ИначеЕсли СтрокаТаблицы.Периодичность.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
			ШапкаСИЗ.Параметры.СледующаяВыдача = НСтр("ru = 'Бессрочно'");
		КонецЕсли;
		ШапкаСИЗ.Параметры.НормаВыдачи = СтрокаТаблицы.Периодичность.Представление;
		
		НайденныеВыдачи = ТаблицаВыдачи.НайтиСтроки(Новый Структура("СИЗ", СтрокаТаблицы.СИЗ));
		БылиВыдачи = НайденныеВыдачи.Количество() > 0;
		ОсталосьВыдать = СтрокаТаблицы.Периодичность.Количество;
		Если БылиВыдачи Тогда
			Для Каждого СтрокаВыдачи Из НайденныеВыдачи Цикл
				Если СтрокаВыдачи.ДатаСледующейВыдачи >= Сегодня Тогда
					ОсталосьВыдать = ОсталосьВыдать - СтрокаВыдачи.Выдано;
				КонецЕсли;
				Если ОсталосьВыдать <= 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ОсталосьВыдать > 0 Тогда
			ШапкаСИЗ.Параметры.ОсталосьВыдать =
				СтрШаблон(НСтр("ru = '%1 %2'"), ОсталосьВыдать, СтрокаТаблицы.Периодичность.ЕдиницаИзмерения);
		КонецЕсли;
		ТабДокумент.Вывести(ШапкаСИЗ);
		
		Если БылиВыдачи Тогда
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
			ОбластьСтрокаВыдачи = Макет.ПолучитьОбласть("СтрокаВыдачи");
			Для Каждого СтрокаВыдачи Из НайденныеВыдачи Цикл
				ОбластьСтрокаВыдачи.Параметры.Заполнить(СтрокаВыдачи);
				ТабДокумент.Вывести(ОбластьСтрокаВыдачи);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТаблицаВыдачи(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыдачиСИЗПоНоменклатуре.СИЗ КАК СИЗ,
		|	МИНИМУМ(ВыдачиСИЗПоНоменклатуре.Период) КАК ДатаВыдачи,
		|	ВыдачиСИЗПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	ВыдачиСИЗПоНоменклатуре.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи КАК ЗаказНаВыдачу,
		|	ВыдачиСИЗПоНоменклатуре.ДокументВыдачи КАК ВыдачаСИЗ,
		|	МАКСИМУМ(ВыдачиСИЗПоНоменклатуре.ДатаСледующейВыдачи) КАК ДатаСледующейВыдачи,
		|	ЕСТЬNULL(ВыданныеСИЗОстатки.КоличествоОстаток, 0) КАК Выдано
		|ИЗ
		|	РегистрСведений.ВыдачиСИЗПоНоменклатуре КАК ВыдачиСИЗПоНоменклатуре
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСИЗ.Остатки КАК ВыданныеСИЗОстатки
		|		ПО ВыдачиСИЗПоНоменклатуре.ФизическоеЛицо = ВыданныеСИЗОстатки.ФизическоеЛицо
		|			И ВыдачиСИЗПоНоменклатуре.ДокументВыдачи = ВыданныеСИЗОстатки.ДокументВыдачи
		|			И ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи = ВыданныеСИЗОстатки.ОснованиеВыдачи
		|			И ВыдачиСИЗПоНоменклатуре.СИЗ = ВыданныеСИЗОстатки.СИЗ
		|ГДЕ
		|	ВыдачиСИЗПоНоменклатуре.ФизическоеЛицо = &ФизическоеЛицо
		|	И ЕСТЬNULL(ВыданныеСИЗОстатки.КоличествоОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиСИЗПоНоменклатуре.СИЗ,
		|	ВыдачиСИЗПоНоменклатуре.Номенклатура,
		|	ВыдачиСИЗПоНоменклатуре.ХарактеристикаНоменклатуры,
		|	ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи,
		|	ВыдачиСИЗПоНоменклатуре.ДокументВыдачи,
		|	ЕСТЬNULL(ВыданныеСИЗОстатки.КоличествоОстаток, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СИЗ,
		|	ДатаВыдачи";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
